inst/doc-covPattern/covariance-pattern.org
#+TITLE: Covariance pattern in LMMstar
#+Author: Brice Ozenne

* LV pattern

** Theory

Consider 4 timepoints. The traditional parametrisation of the residual
variance-covariance matrix of a factor model is
#+BEGIN_EXPORT latex
\[ \Omega = \begin{bmatrix}
\omega^2_1 + \tau & .                           & .                           & . \\
\lambda_2 \tau    & \omega^2_2 + \lambda^2_2\tau & .                           & . \\
\lambda_3 \tau    & \lambda_2 \lambda_3 \tau    & \omega^2_3 + \lambda^2_3 \tau & . \\
\lambda_4 \tau    & \lambda_2 \lambda_4 \tau    & \lambda_3 \lambda_4 \tau     & \omega^2_4 + \lambda^2_4 \tau \\
\end{bmatrix} \]
#+END_EXPORT
LMMstar uses a different parametrisation with distinct parameters for
the variance and the correlation:
#+BEGIN_EXPORT latex
\[ \Omega = \begin{bmatrix}
\sigma^2_1                      & .                              & .                               & . \\
\rho_1 \rho_2 \sigma_1 \sigma_2 & \sigma^2_2                      & .                              & . \\
\rho_1 \rho_3 \sigma_1 \sigma_3 & \rho_2 \rho_3 \sigma_2 \sigma_3 & \sigma^2_3                      & . \\
\rho_1 \rho_4 \sigma_1 \sigma_4 & \rho_2 \rho_4 \sigma_2 \sigma_4 & \rho_3 \rho_4 \sigma_3 \sigma_4 & \sigma^2_4 \\
\end{bmatrix} \]
#+END_EXPORT

The two parametrisation are equivalent when assuming the same sign for
all correlation (e.g. all positive correlation).

\bigskip

\(\boldsymbol{\omega},\boldsymbol{\tau},\boldsymbol{\lambda}
\rightarrow \boldsymbol{\rho},\boldsymbol{\sigma}\): the \(\sigma\)
values can be deduce from the diagonal of \(\Omega\). \newline To get the
\(\rho\) value, we can first multiply \(\rho_1 \rho_2 \sigma_1
\sigma_2 = \lambda_2 \tau \) by \(\rho_1 \rho_3 \sigma_1 \sigma_3 =
\lambda_3 \tau \) and divide by \(\rho_2 \rho_3 \sigma_2 \sigma_3 =
\lambda_2 \lambda_3 \tau \):
#+BEGIN_EXPORT latex
\begin{align*}
\frac{\rho_1^2 \rho_2 \rho_3 \sigma_1^2 \sigma_2 \sigma_3}{\rho_2 \rho_3 \sigma_2 \sigma_3} &= \frac{\lambda_2 \lambda_3 \tau^2}{\lambda_2 \lambda_3 \tau} \\
\rho_1^2 \sigma_1^2 &= \tau \\
\rho_1^2 = \frac{\tau}{\omega_1^2 + \tau}
\end{align*}
#+END_EXPORT
More generally, denoting \(\lambda_1=1\), from:
#+BEGIN_EXPORT latex
\begin{align*}
\sigma_i^2  &= \omega_i^2+\lambda_i^2\tau \\
\rho_i \rho_j \sigma_i \sigma_j &= \lambda_i \lambda_j \tau
\end{align*}
#+END_EXPORT
we can deduce
#+BEGIN_EXPORT latex
\begin{align*}
\rho_i^2 \rho_j \rho_k  \sigma_i^2 \sigma_j \sigma_k &= \lambda_i^2 \lambda_j \lambda_k \tau^2 \\
\rho_i^2  \sigma_i^2 &= \lambda_i^2 \tau \\
\rho_i  &=  \sqrt{\frac{\lambda_i^2 \tau}{\omega_i^2+\lambda_i^2\tau}}
\end{align*}
#+END_EXPORT
Technical \(\rho_i\) could be negative but here use the assumption of
same (positive) sign for all correlations.

\bigskip

\( \boldsymbol{\rho},\boldsymbol{\sigma} \rightarrow
\boldsymbol{\omega},\boldsymbol{\tau},\boldsymbol{\lambda}\): we can re-use the previous result:
#+BEGIN_EXPORT latex
\begin{align*}
\rho_i^2  &=  \frac{\lambda_i^2 \tau}{\omega_i^2+\lambda_i^2\tau} = \frac{\lambda_i^2 \tau}{\sigma_i^2}
\end{align*}
#+END_EXPORT
So for \(i=1\):
#+BEGIN_EXPORT latex
\begin{align*}
\tau  &= \rho_1^2 \sigma_1^2
\end{align*}
#+END_EXPORT
and otherwise:
#+BEGIN_EXPORT latex
\begin{align*}
\lambda_i^2  &=  \frac{\rho_i^2 \sigma_i^2}{\rho_1^2 \sigma_1^2} \\
\lambda_i  &= sign(\rho_1 \rho_i) \frac{\rho_i\sigma_i}{\rho_1 \sigma_1}
\end{align*}
#+END_EXPORT
One can then deduce \(\omega_i\):
#+BEGIN_EXPORT latex
\begin{align*}
\omega_i  &=  \sqrt{\sigma_i^2 - \lambda_i \tau} = \sigma_i \sqrt{1-\rho_i^2}
\end{align*}
#+END_EXPORT

\clearpage

