inst/doc-covPattern/covariance-pattern.tex

\subsection{Example}
\label{sec:org610e4e1}

Simulate data
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
library(lava)
library(LMMstar)

mSim <- lvm(c(Y1,Y2,Y3,Y4)~eta+age)
latent(mSim) <- ~eta

set.seed(10)
n <- 100
n.time <- length(endogenous(mSim))
dfW.sim <- cbind(id = paste0("Id",1:n), sim(mSim, n = n, latent = FALSE))
dfW.sim$id <- factor(dfW.sim$id, unique(dfW.sim$id))
head(dfW.sim)
\end{lstlisting}

\begin{verbatim}
   id         Y1          Y2         Y3         Y4        age
1 Id1  0.8087642  0.02821369  2.0055318 2.29256267  0.8694750
2 Id2  0.3174894  0.92111736  0.8326184 1.09215142 -0.6800096
3 Id3  0.9880281  1.31941524  3.7496337 1.72867315  0.1732145
4 Id4 -0.3524308  0.95831086  1.1187839 1.03908643 -0.1594380
5 Id5  0.3496855 -0.57807269 -1.0256767 0.18052490  0.7934994
6 Id6  0.1276581  0.30103845  0.2336854 0.06061876  1.6943505
\end{verbatim}


Convert to long format:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
dfL.sim <- reshape(dfW.sim, direction = "long", idvar = c("id","age"), varying = paste0("Y",1:4), sep="")
dfL.sim$time <- as.factor(dfL.sim$time)
rownames(dfL.sim) <- NULL
head(dfL.sim)
\end{lstlisting}

\begin{verbatim}
   id        age time          Y
1 Id1  0.8694750    1  0.8087642
2 Id2 -0.6800096    1  0.3174894
3 Id3  0.1732145    1  0.9880281
4 Id4 -0.1594380    1 -0.3524308
5 Id5  0.7934994    1  0.3496855
6 Id6  1.6943505    1  0.1276581
\end{verbatim}


Fit LVM:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
m.lvm <- lvm(c(Y1,Y2,Y3,Y4)~eta+age, eta ~ 0)
latent(m.lvm) <- ~eta
e.lvm <- estimate(m.lvm, data = dfW.sim)
logLik(e.lvm)
\end{lstlisting}

\begin{verbatim}
'log Lik.' -651.0478 (df=16)
\end{verbatim}


Export coefficient by type:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
mu.lvm <- coef(e.lvm)[c(paste0("Y",1:n.time),paste0("Y",1:n.time,"~age"))]
lambda.lvm <- c(1,coef(e.lvm)[paste0("Y",2:n.time,"~eta")])
tau.lvm <- coef(e.lvm)["eta~~eta"]
omega.lvm <- coef(e.lvm)[paste0("Y",1:n.time,"~~Y",1:n.time)]
list(mu = mu.lvm,
     lambda = lambda.lvm,
     tau = tau.lvm,
     omega = omega.lvm)
\end{lstlisting}

\begin{verbatim}
$mu
        Y1         Y2         Y3         Y4     Y1~age     Y2~age     Y3~age 
-0.1835368 -0.1491306 -0.0194078  0.1459640  0.9502774  1.0535363  0.9671297 
    Y4~age 
 1.0349377 

$lambda
             Y2~eta    Y3~eta    Y4~eta 
1.0000000 0.8653753 1.1024519 1.0537868 

$tau
eta~~eta 
1.259395 

$omega
   Y1~~Y1    Y2~~Y2    Y3~~Y3    Y4~~Y4 
0.8444582 0.9968492 1.0012298 0.9868099
\end{verbatim}

Conversion to LMM coefficients:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
list(sigma = sqrt(omega.lvm + lambda.lvm^2 * tau.lvm),
     rho = sqrt( lambda.lvm^2 * tau.lvm / (omega.lvm + lambda.lvm^2 * tau.lvm)))
\end{lstlisting}

\begin{verbatim}
$sigma
  Y1~~Y1   Y2~~Y2   Y3~~Y3   Y4~~Y4 
1.450466 1.392831 1.591194 1.544450 

$rho
             Y2~eta    Y3~eta    Y4~eta 
0.7737012 0.6972477 0.7775305 0.7657021
\end{verbatim}


\clearpage

Fit LMM:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
rhoLVM <- function(p,time,...){
  R <- tcrossprod(p[time])
  diag(R) <- 1
  return(R)
}
myStruct <- CUSTOM(~time,
		   FCT.sigma = function(p,time,X){p[time]},
		   init.sigma = setNames(rep(1.45,n.time),paste0("sigma",1:n.time)),
		   FCT.rho = rhoLVM,
		   init.rho = setNames(rep(0.7,n.time),paste0("rho",1:n.time)))
e.lmmCUSTOM <- lmm(Y ~ time*age,
		   repetition = ~time|id,
		   structure  = myStruct, data = dfL.sim,
		   method.fit = "ML")
logLik(e.lmmCUSTOM)
\end{lstlisting}

\begin{verbatim}
[1] -651.0478
\end{verbatim}


We get exactly the same log-likelihood as the latent variable
model. Export coefficient by type:

\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
mu.lmm <- coef(e.lmmCUSTOM, effects = "mean")
sigma.lmm <- coef(e.lmmCUSTOM, effects = "variance")
rho.lmm <- coef(e.lmmCUSTOM, effects = "correlation")
list(mu = mu.lmm,
     sigma = sigma.lmm,
     rho = rho.lmm)
\end{lstlisting}

\begin{verbatim}
$mu
(Intercept)       time2       time3       time4         age   time2:age 
-0.18353676  0.03440620  0.16412896  0.32950080  0.95027744  0.10325886 
  time3:age   time4:age 
 0.01685224  0.08466026 

$sigma
  sigma1   sigma2   sigma3   sigma4 
1.450466 1.392831 1.591194 1.544450 

$rho
     rho1      rho2      rho3      rho4 
0.7737013 0.6972475 0.7775306 0.7657020
\end{verbatim}

\clearpage

Conversion to LVM coefficients:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
list(lambda = rho.lmm*sigma.lmm/(rho.lmm[1]*sigma.lmm[1]),
     tau = rho.lmm[1]^2*sigma.lmm[1]^2,
     omega = sigma.lmm^2 * (1-rho.lmm^2))
\end{lstlisting}

\begin{verbatim}
$lambda
    rho1     rho2     rho3     rho4 
1.000000 0.865375 1.102452 1.053786 

$tau
    rho1 
1.259395 

$omega
   sigma1    sigma2    sigma3    sigma4 
0.8444578 0.9968496 1.0012293 0.9868104
\end{verbatim}
\end{document}